
[
        {
            "name": "Giacomo Balla",
            "text": "Giacomo Balla (1871-1958) was an art teacher who went on to become one of the most influential members of the futurist movement in Italy. He was a respected artist prior to his involvement in futurism, attending the University of Turin and working in Rome as a portrait painter, illustrator, and caricaturist. He taught Divisionist techniques to Umberto Boccioni and Gino Severini, who also became involved with futurism themselves. He was deeply inspired by the writings of Filippo Tommaso Marinetti, and was signatory to his Futurist Manifesto. During World War I, his studio became a gathering place for young artists. His most famous painting is Dynamism of a Dog on a Leash, completed in 1912. He died in Rome at the age of 86.",
            "images": ["images/ballagal1.jpg", "images/ballagal2.jpg", "images/ballagal3.jpg", "images/ballagal4.jpg", "images/ballagal5.jpg", "images/ballagal6.jpg"]
        },
        {
            "name": "Umberto Boccioni",
            "text": "In his rather short life, Umberto Boccioni (1882-1916) managed to position himself as one of the most active and most prolific artists in the futurist movement in Italy. He was the student of Giacomo Balla, and a friend of Gino Severini, both of whom were influential artists in the movement. Under Balla, he studied divisionist techniques. He then dabbled in the impressionist and post-impressionist styles in Paris for a while. After this, he visited Russia for a few months, getting a good glimpse at all the civil unrest that was going on in Russia at that time. After returning to italy in 1907, he studied drawing at the Accademia di Belle Arti in Venice. It was in 1907 when he began to align himself with the futurist style, after having read the Futurist Maifesto of Filippo Tommaso Marinetti. In 1912, he transitioned his focus from painting to sculpture, after visiting the studios of various sculptors in Paris. In 1916, he was drafted into the Italian army for World War I. It was in this year he passed away after being trampled by his horse in an army training accident at the age of 33.",
            "images":["images/boccionigal1.jpg", "images/boccionigal2.jpg", "images/boccionigal3.jpg", "images/boccionigal4.jpg", "images/boccionigal5.jpg"]
        },
        {
            "name": "Gino Severini",
            "text": "Gino Severini (1883-1966) was one of the leading Italian painters of the Futurist movement. In addition to traditional oil on canvas painting, Severini also dabbled in other media, including fresco and mosaic. As a youth, he attended Scuola Tecnica, a school in Cortona, Italy. At the age of 15, he stole exam papers at school, which led him to be expelled from the entire Italian school system. With sponsorship from a patron, Severini attended 2 art schools before his patron cut his financial assistance. He met Umberto Boccioni in 1900, and the two of them together learned divisionist techniques from Giacomo Balla. Both Balla and Boccioni also went on to become very influential members of the futurist movement. He began contributing to the futurist style around 1910, but switched to a more neo-classical style around 1916. Around 1940, he changed styles yet again, this time to a semi-abstract one, before finally returning to futurist subject matter around 1950. He died in Paris at the age of 82.",
            "images":["images/ginogal1.jpg", "images/ginogal2.jpg", "images/ginogal3.jpg", "images/ginogal4.jpg", "images/ginogal5.jpg"]
        },
        {
            "name": "Carlo Carrà",
            "text": "Carlo Carrà (1881-1966) was one of the leading Italian painters of the Futurist movement. At the young age of 12, Carrà left his home of Quargento to become a mural decorator. In 1899, he visited Paris, where he decorated pavillions at the Exposition Universelle, where he became influenced by the French art of the day. After this, he interestingly spent some time in London, in communication with exiled Italian anarchists. He returned to Italy in 1901. He enrolled in the Brera Academy in Milan, where he studied under a painter named Cesare Tallone. Carràs Futurist style ends around of World War I, where his focus turned to what he called metaphysical still lifes. Still, he is best known for his involvement with Futurism, and his work The Funeral of the Anarchist Galli is the painting he is most remembered for. It displays his style and his anarchist ties to a tee. He died in Milan at the age of 84.",
            "images":["images/carragal1.jpg", "images/carragal2.jpg", "images/carragal3.jpg"]
        },
        {
            "name": "Natalia Goncharova",
            "text": "Natalia Goncharova (1881-1962) was an influential painter to the Cubo-Futurist style in Russia. She attended the Moscow School of Painting, Sculpture, and Architecture in 1898 as a sculptor, but switched to painting during the course of her education. While studying at the academy, she met fellow Cubo-Futurist artist Mikhail Larionov, with whom she started 2 major groups of artists: the Jack of Diamonds, and the Donkey's Tail. She was also a member of Der Blaue Reiter, a very influential group in the Russian avant-garde. She was also involved in illustration, costume design, and set design. She became a French citizen 1939, and died in Paris in 1962. Most of her work attributed to her Futurist style is from later on in her career. To this date, her works are some of the most expensive at auction for a female artist.",
            "images":["images/gonchagal1.jpg", "images/gonchagal2.jpg", "images/gonchagal3.jpg", "images/gonchagal4.jpg"]
        },
        {
            "name": "Luigi De Giudici",
            "text": "Luigi De Giudici (1887-1955) was a Venetian painter who is sometimes included as being involved with Italian Futurism. His work is also sometimes said to contain elements of Expressionism as well. He exhibited his works at Ca Pesaro, a palace in Venice where artists representing a wide variety of styles showcased their work. De Giudici was influenced by this stylistic melting pot, prior to his decision to quit painting in 1919 at the age of 32.",
            "images":["images/lgdgal1.jpg", "images/lgdgal2.jpg", "images/lgdgal3.jpg"]
        },
        {
            "name": "Enrico Prampolini",
            "text": "Enrico Prampolini (1894 - 1956) was a Futurist painter, scenographer, and sculptor from Italy. He played a role in the design of the Exhibition of the Fascist Revolution. His painting is largely considered to be abstract or quasi-abstract. He was educated at the Academy of Fine Arts in Rome. He was known to be in contact with some of the key driving figures of the avant-garde art scene of the early 1900s, including Pablo Picasso, Piet Mondrian, Wassily Kandinsky, and Jean Cocteau. His works in both set design and abstract art give him a unique place in the history of European art.",
            "images":["images/prampgal1.jpg", "images/prampgal2.jpg", "images/prampgal3.jpg"]
        },
        {
            "name": "Fortunato Depero",
            "text": "Fortunato Depero (1892 - 1960) was an Italian Futurist sculptor, painter, illustrator, and writer. Deperto grew up in the town of Rovereto, which is where he first began to exhibit his art while working as an apprentice to a marble worker. In 1913, he took a trip to Florence, where he discovered the Futurist publications of writer Fillippo Tommasso Marinetti. He traveled to Rome the following year, where he met Futurist painter Giacomo Balla. With Balla, he wrote the Futurist Reconstruction of the Universe, a publication expanding on the ideas of some of the other Futurist ideologists. He founded the House of Futurist Art in Rovereto, which produced toys, tapestries, and furniture in the Futurist style. In 1928, Depero moved to New York City, where he worked for 2 years. He returned to Italy in 1930. Depero continued to paint in the 30s and 40s, but his Futurist work had begun its decline, due to the style falling out of favor. In 1959, he opened his own gallery. Due to complications from his diabetes, he died at age 68",
            "images":["images/deperogal1.jpg", "images/deperogal2.jpg", "images/deperogal3.jpg"]
        },
        {
            "name": "Luigi Russolo",
            "text": "Luigi Russolo (1885-1947) was an Italian Futurist painter and musician. While he is grouped among the Futurist painters, his main contribution comes from his innovation of what he called noise art. He viewed traditional music as confining, and that the Industrial Revolution brought man the appreciation of more complex sounds. To this end, he was known for creating his own unique noise-making instruments. He is considered the first major theorist of electronic music.",
            "images": ["images/russologal1.jpg", "images/russologal2.jpg", "images/russologal3.jpg"]
        },
        {
            "name": "Mikhail Larionov",
            "text": "Mihkhail Larionov (1881-1964) was an avant-garde Russian painter involved with Cubo-Futurism. He was born in Tiraspol, Russia, and entered the Moscow School of Painting, Sculpture, and Architecture in 1898. He was suspended 3 times during the course of his attendance there. In 1990, he met fellow Russian avant-garde painter Natalia Goncharova, with whom he developed a lifelong friendship. With Goncharova, he co-founded 2 major groups of artists, the Jack of Diamonds and the Donkey's Tail. Larionov dabbled in many styles, including Impressionism, Post-Impressionism, Cubo-Futurism, and Rayonism - a style of his own invention. Rayonism was among the first styles of abstract art to emerge in Russia. He died in Paris at the age of 82.",
            "images": ["images/larionovgal1.jpg", "images/larionovgal2.jpg", "images/larionovgal3.jpg"]
        },
        {
            "name": "Olga Rozanova",
            "text": "Olga Rozanova (1886-1918) was a Russian avant-garde artist. She painted in the Suprematist, Neo-Primitivist, and Cubo-Futurist styles. Rozanova was born in the small town of Melenki. She gained her education at the Stroganov School of Applied Art. Around 1911, she was involved with a group caled the Soyuz Molodyozhi, or Union of the Youth. In 1912, she started friendships with the Futurist poets Velimir Khlebnikov and Aleksei Kruchenykh, the latter of which she later marries in 1916. Around this time, she also joins the art group Supremus, started by famed artist Kazimir Malevich. She died of diptheria in 1918, at the age of 32.",
            "images": ["images/olgagal1.jpg", "images/olgagal2.jpg", "images/olgagal3.jpg"]
        },
        {
            "name": "Vladimir Baranov-Rossine",
            "text": "Baranov-Rossine (1888-1944) was a Russian-French painter and inventor. He was born in the town of Kherson, and studied at the School of the Society for the the Furthering of the Arts in St. Petersburg in 1902. He switched to study at the Imperial Academy of Arts in St. Petersburg a year later. He exhibited his work in Kiev with artist brothers David and Wladimir Burliuk. He moved to Paris in 1910. While in Paris, he worked with artists Sonia Delaunay-Terk, Alexander Archipenko, Nathan Altman, and others in what was known at the La Ruche artist colony. Arter regularly exhibiting in Paris, he Returned to Russia in 1914. He became involved with the Jewish Society for the Furthering of the Arts in Moscow, and exhibited solo as well. He became a teacher of Higher Artistic-Technical Workshops in 1922. He immigrated to France in 1925. Throughout his life, Boranov-Rossine dabbled in the use of art in the military. Interestingly, he played a role in the development of camouflage as we know it today. During the German occupation of France, Boranov-Rossine was deported and executed in a Nazi concentration camp in 1944. He painted in many styles, Cubo-Futurism among them.",
            "images": ["images/b-rgal1.jpg", "images/b-rgal2.jpg", "images/b-rgal3.jpg"]
        },
        {
            "name": "Alexander Bogomazov",
            "text": "Alexander Bogomazov (1880-1930) was a Ukranian artist with ties to the Russian Avant-garde. He was known for being a well-written art theoretician. He was born in the town of Yampol. After studying agriculture for a few years, he decided to study art at the Kiev Art School. He was active in political demonstrations and strikes in the early 1900s. He was expelled from the Kiev Art School in 1905. He studied in different artists studios in Moscow and Kiev. He made a journey to Finland in 1911, before returning to Kiev a year later to teach at a school for the deaf and mute. He began studying the works of the Italian Futurists around 1913-1914, which led to the development of his own Futurist style. He proceeded to work and teach at multiple venues and studios in Kiev prior to his death at the age of 50.",
            "images" : ["images/bogogal1.jpg", "images/bogogal2.jpg", "images/bogogal3.jpg", "images/bogogal4.jpg"]
        },
        {
            "name": "Lyubov Popova",
            "text": "Popova (1889-1924) was a painter who painted in the Cubo-Futurist, Suprematist, and Constructivist styles. She was born in the town of Ivanovskoe to the family of a wealthy textile merchant. She displayed proficiency in the arts from a young age, starting art lessons at age 11. At age 18, she began studying with artist Stanislav Zhukovsky, and entered the private studios of Konstantin Yuon and Ivan Dudin. From 1909-1913, she traveled all over Russia, taking a particular interest in ancient cities like St. Petersburg to study religious icons. She moved to Paris in 1912, and studied art there for a year where she met other influential artists. She returned to Russia later in 1913, and worked with other artists in Moscow. She traveled back to France, and then to Italy a year later, around the time where both Cubism and Futurism were beginning to take shap, giving her the influence to develop her Cubo-Futurist style. Her primary work in this style was apparent from 1914-1915, in which she exhibited her Cubo-Futurist work to the two Knave of Diamonds exhibitions in Moscow and Petrograd. Her later career saw her working in both Suprematist and Constructivist styles. In 1918, Popova married an art historian by the name of Boris Eding. They had a son, Von Eding, who died from typhoid fever a year later. Popova caught the disease later and became seriously ill, but survived. She died of scarlet fever in 1924 in Moscow, at the age of 35.",
            "images" : ["images/popovagal1.jpg", "images/popovagal2.jpg", "images/popovagal3.jpg", "images/popovagal4.jpg"]
        },
        {
            "name": "Wladimir Burliuk",
            "text": "Wladimir Burliuk (1886-1917) was born in Kharkiv, Ukraine. He was the brother of David Burliuk, the father of Russian Futurism. He was an illustrator of the Cubo-Futurist and Primitivist styles. He studied at the Azbe School in Munich, Germany prior to joining the Russo-Japanese War as a soldier a year later. He attended the Kiev Art School from 1905-1910. During the following few years, he moved and worked in assorted locations in Russia and Ukraine. He was a member of the Jack of Diamonds art group in 1910. That same year, he also joined the Union of the Youth, another group of artists. He joined the art school in Odessa in the year 1911. For the remainder of his career, he illustrated book covers in the Futurist style, including one with famed artist Kazimir Malevich. He was drafter into service in World War I in 1916, where he died in battle in what is now Thessaloniki, Greece. He was 32.",
            "images" : ["images/wladimirgal1.jpg", "images/wladimirgal2.jpg", "images/wladimirgal3.jpg"]
        },
        {
            "name": "David Burliuk",
            "text": "David Burliuk (1882-1967) was a Ukrainian artist, publicist, illustrator, and author of the Futurist movement. He is called the Father of Russian Futurism by some. He was born in 1882 in the town of Semyrotivka, which is near what was then the village of Riabushky. He attended art schools in Kazan, Odessa, and at the Royal Academy in Munich. He exhibited work with the group known as Zveno, or The Link in 1908. In 1910, be became a member of the art group Jack of Diamonds, in which he and a lot of what would become his fellow Futurists would exhibit their work. In 1912, he co-authored a manifesto entitled A Slap in the Face of Public Taste, which many credit as being the beginnings of the Futurist movement in Russia. He adopted the principles of Italian author Filippo Marinetti, who was the jump-starter of the movement in Italy. He was expelled from the Royal Academy in 1913, and in that same year, he founded Hylaea, a literary group whose work was rooted in Futurist ideals.",
            "images": ["images/burliukgal1.jpg", "images/burliukgal2.jpg", "images/burliukgal3.jpg"]
        },
        {
            "name": "Nikolay Diulgheroff",
            "text": "Diulgheroff (1901-1982) was a Bulgarian painter who was active in Italy and contributed to the Futurist movement while working there. He was born in the town of Kyustendil. He studied in Austria for a year in 1920, prior to moving to Germany and studying there. He exhibited his work in both Germany and Bulgaria before leaving for Italy in 1926. He moved to Turin to study architecture at the Accademia Albertina. It was here he became a major contributor to interwar Futurism. He worked in Turin until his death, in 1982.",
            "images": ["images/nikogal1.jpg", "images/nikogal2.jpg", "images/nikogal3.jpg"]
        },
        {
            "name": "Gerardo Dottori",
            "text": "Gerardo Dottori (1887-1977) was an Italian Futurist painter. He was born in and spent much of his career in the town of Perugia. He attended the Academy of Fine Arts there prior to visiting Rome in 1911. Here he met famed Futurist painter Giacomo Balla, bringing home an appreciation for the Futurist style. He fought in World War I in 1915, and survived. He was mainly known for being involved with Aeropainting, or the rendering of planes and aerial scenes/landscapes. In fact his favorite subjects were aerial views of the city of Umbria.",
            "images": ["images/dottorigal1.jpg", "images/dottorigal2.jpg", "images/dottorigal3.jpg"]
        },
        {
            "name": "Fillìa (Luigi Colombo)",
            "text": "Luigi Colombo (1904-1936), better known by his adopted name Fillìa, was a second-generation Italian Futurist painter. He was born in Revello, Piedmont, and was known for kick-starting the Futurist movement in the city of Turin. He became the leader of a group of Futurist artists in the city, and a principal theorist of the Futurist movement, having made publications with Filipo Tommaso Marinetti. He died in his home town of Turin at age 32.",
            "images": ["images/filiagal1.jpg", "images/filiagal2.jpg", "images/filiagal3.jpg"]
        },
        {
            "name": "Kazimir Malevich",
            "text": "Kazimir Malevich (1879-1935) was one of the more influential painters of the Russian avant-garde. Kazimir was the first of 14 children of his family, of which only 9 survived to grow up into adults. While he is largely known for his invention of the abstract Suprematist style, he was also involved the beginnings of the Cubo-Futurist movement in Russia during his involvement with the Donkey's Tail art group in Moscow. It was here his style was influenced by fellow Cubo-Futurist artist Natalia Goncharova. He was born Kazimierz Malewics, to a family of Polish origin in Russia. He published a manifesto, entitled From Cubism to Suprematism, which laid out the foundations of the Suprematist movement, which he created. Suprematism deals with creation of abstract compositions using geometric shapes. He died of cancer in Leningrad at the age of 56. This site is dedicated specifically to documenting the art of the Futurist movement in world art, so here a selection of his earlier Cubo-Futurist work will be shown instead of his later Suprematist work.",
            "images": ["images/malevichgal1.jpg", "images/malevichgal2.jpg", "images/malevichgal3.jpg", "images/malevichgal4.jpg"]
        },
        {
            "name": "Filippo Tommaso Marinetti",
            "text": "While this site is dedicated to the documenting of the painters of the Futurist movement in art history, Marinetti, a poet, is credited with the creation of the movement. Thus, a small biographical summary is included here.  Born Emilio Angelo Carlo Marinetti (some documents record his name as Filippo Achille Emilio Marinetti) was born in and spent the first few years of his life in Alexandria, Egypt. His parents were there on a business trip. He first studied in Egypt, prior to moving to Paris to obtain a degree at the Sorbonne in 1894. He then moved to Italy, where he studied law. After this, he decided he wasn't going to become a lawyer, but decided to pursue a career as a writer.  He is known best for his authoring of the Futurist Manifesto, which he comleted in 1909. This described the concepts and ideals in which all the artists who aligned themselves with the Futurist movement decided to portray in their art. He was also notorious for his Fascist governmental beliefs, having become involved politically with the Fascist party of Italy around 1918. This began with him founding his own political party, the Partito Politico Futurista, which merged with Mussolini's Fascist party a year later. He died of cardiac arrest in 1944.",
            "images":["images/marinetti.jpg"]
        },
        {
            "name": "Frances Simpson Stevens",
            "text": "Frances Simpson Stevens (1894-1976) is known as the only major American-born painter to be grouped in with the Futurist movement. She spent the beginning of her life in the state of Massachusetts, but moved to New York in her adult life. In the summer of 1912, she took summer painting lessons from the famous Realist artist of the Ashcan school, Robert Henri. Returning to New York, she went on to exhibit her work at the Armory Show of 1913. After her exhibition in New York ended, she took a trip to Florence, where she came into contact with Marinetti and the Italian Futurists. She became the only person from America to exhibit her work at the 1914 Esposizopne Libera Futurista Internazionale in Rome. Returning to New York, she continued her work there and married a Siberian prince, Dmitri of the House of Golitsyn. Spending 2 years in Siberia, she returned to New York again after the prince lost his posessions. She soon disappeared from public eye. Sadly, very little of her work survives today.",
            "images": ["images/stevensgal1.jpg", "images/stevensgal2.jpg", "images/stevensgal3.jpg"]
        },
        
        {
            "name": "Joseph Stella",
            "text": "Joseph Stella (1877-1946) was an Italian-born, American painter of the Futurist movement. He was born in the village of Muro Lucano, Italy, and moved to New York to study medicine in 1896. He ended up giving up medicine to pursue a career in art, studying at the Art Students League of New York. He had a strong distate for American culture at first, so he moved back to Italy in 1909. It was around this time he met Futurist painters Gino Severini and Umberto Boccioni, which gave his own work heavy Futurist influence, although he was not afraid to draw elements from other styles. He made the decision to return to New York in 1913. He exhibited in the famed Armory Show later that year. In the 1930s, he travelled around the world, taking in different styles of painting. He ultimately returned to New York, where he spent the remainder of his life. He painted in many styles, but he is typically remembered for his work in Futurism and Precisionism.",
            "images": ["images/stellagal1.jpg", "images/stellagal2.jpg", "images/stellagal3.jpg", "images/stellagal4.jpg"]
        }
    ]
